# Exploratory  Data

In [3]:
import pandas as pd

In [2]:
df = pd.read_csv('user_dataset.csv')

In [3]:
df.describe(include=object)
#string values

                               user_name   customer_city customer_state
count                              99441           99441          99441
unique                             96096             514             34
top     8d50f5eadf50201ccdcedfb9e2ac8455  KOTA TANGERANG         BANTEN
freq                                  17           15585          21196

In [4]:
df.describe()
#the only numeric values

       customer_zip_code
count       99441.000000
mean        35137.474583
std         29797.938996
min          1003.000000
25%         11347.000000
50%         24416.000000
75%         58900.000000
max         99990.000000

In [5]:
df.head()

,user_name,customer_zip_code,customer_city,customer_state
0,861eff4711a542e4b93843c6dd7febb0,14409,KABUPATEN PEKALONGAN,JAWA TENGAH
1,290c77bc529b7ac935b93aa66c333dc3,9790,KOTA BEKASI,JAWA BARAT
2,060e732b5b29e8181a18229c7b0b2b5e,1151,KOTA TANGERANG,BANTEN
3,259dac757896d24d7702b9acbbff3f3c,8775,KABUPATEN BANDUNG BARAT,JAWA BARAT
4,345ecd01c38d18a9036ed96c73b8d066,13056,KOTA JAKARTA TIMUR,DKI JAKARTA

In [6]:
type(df)

pandas.core.frame.DataFrame

In [7]:
df.shape
# (rows,columns)

(99441, 4)

In [8]:
len(df)
#number of rows

99441

In [9]:
df.tail()

,user_name,customer_zip_code,customer_city,customer_state
99436,1a29b476fee25c95fbafc67c5ac95cf8,3937,KOTA TANGERANG,BANTEN
99437,d52a67c98be1cf6a5c84435bd38d095d,6764,KOTA PONTIANAK,KALIMANTAN BARAT
99438,e9f50caf99f032f0bf3c55141f019d99,60115,KABUPATEN SIDOARJO,JAWA TIMUR
99439,73c2643a0a458b49f58cea58833b192e,92120,KABUPATEN CIANJUR,JAWA BARAT
99440,84732c5050c01db9b23e19ba39899398,6703,KOTA SUKABUMI,JAWA BARAT

In [10]:
df.info()
#row = entries

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99441 entries, 0 to 99440
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   user_name          99441 non-null  object
 1   customer_zip_code  99441 non-null  int64
 2   customer_city      99441 non-null  object
 3   customer_state     99441 non-null  object
dtypes: int64(1), object(3)
memory usage: 3.0+ MB

In [51]:
# object data type is “a catch-all for columns that pandas doesn’t recognize as any other specific type.
# ” In practice, it often means that all of the values in the column are strings.

In [11]:
df.notnull()

       user_name  customer_zip_code  customer_city  customer_state
0           True               True           True            True
1           True               True           True            True
2           True               True           True            True
3           True               True           True            True
4           True               True           True            True
...          ...                ...            ...             ...
99436       True               True           True            True
99437       True               True           True            True
99438       True               True           True            True
99439       True               True           True            True
99440       True               True           True            True

[99441 rows x 4 columns]

# Data Transformation

In [12]:
#renaming columns
df.rename(columns = {'user_name':'user_id', 'customer_zip_code':'user_zip_code','customer_city':'user_city','customer_state':'user_state'}, inplace = True)

In [13]:
df.head()

,user_id,user_zip_code,user_city,user_state
0,861eff4711a542e4b93843c6dd7febb0,14409,KABUPATEN PEKALONGAN,JAWA TENGAH
1,290c77bc529b7ac935b93aa66c333dc3,9790,KOTA BEKASI,JAWA BARAT
2,060e732b5b29e8181a18229c7b0b2b5e,1151,KOTA TANGERANG,BANTEN
3,259dac757896d24d7702b9acbbff3f3c,8775,KABUPATEN BANDUNG BARAT,JAWA BARAT
4,345ecd01c38d18a9036ed96c73b8d066,13056,KOTA JAKARTA TIMUR,DKI JAKARTA

In [15]:
# length of cell i user_name column
len(df.at[0, 'user_id'])

32

In [16]:
# Convert the 'user_name' ,user_city,user_state column from object to string
df['user_id'] = df['user_id'].astype("string")
df['user_city'] = df['user_city'].astype("string")
df['user_state'] = df['user_state'].astype("string")

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99441 entries, 0 to 99440
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   user_id        99441 non-null  string
 1   user_zip_code  99441 non-null  int64
 2   user_city      99441 non-null  string
 3   user_state     99441 non-null  string
dtypes: int64(1), string(3)
memory usage: 3.0 MB

In [1]:
# Export the DataFrame to a CSV file
df.to_csv('user_dataset_1.csv', index=False)

NameError: name 'df' is not defined

In [4]:
df1 = pd.read_csv('user_dataset_1.csv')

In [5]:
df1.head()

,user_id,user_zip_code,user_city,user_state
0,861eff4711a542e4b93843c6dd7febb0,14409,KABUPATEN PEKALONGAN,JAWA TENGAH
1,290c77bc529b7ac935b93aa66c333dc3,9790,KOTA BEKASI,JAWA BARAT
2,060e732b5b29e8181a18229c7b0b2b5e,1151,KOTA TANGERANG,BANTEN
3,259dac757896d24d7702b9acbbff3f3c,8775,KABUPATEN BANDUNG BARAT,JAWA BARAT
4,345ecd01c38d18a9036ed96c73b8d066,13056,KOTA JAKARTA TIMUR,DKI JAKARTA

In [6]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99441 entries, 0 to 99440
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   user_id        99441 non-null  object
 1   user_zip_code  99441 non-null  int64
 2   user_city      99441 non-null  object
 3   user_state     99441 non-null  object
dtypes: int64(1), object(3)
memory usage: 3.0+ MB